STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_sd.h
/**
  ******************************************************************************
  * @file    stm32g0c1e_eval_sd.h
  * @author  MCD Application Team
  * @brief   This file contains the common defines and functions prototypes for
  *          the STM32G0C1E_EVAL_sd.c driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 STMicroelectronics</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32G0C1E_EVAL_SD_H
#define STM32G0C1E_EVAL_SD_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0c1e_eval.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32G0C1E_EVAL
  * @{
  */

/** @defgroup STM32G0C1E_EVAL_SD STM32G0C1E_EVAL SD
  * @{
  */

/** @defgroup STM32G0C1E_EVAL_SD_Exported_Types Exported Types
  * @{
  */
  
/** 
  * @brief  SD status structure definition  
  */     
enum {
      BSP_SD_OK = 0x00,
      MSD_OK = 0x00,
      BSP_SD_ERROR = 0x01,
      MSD_ERROR = 0x01,
      BSP_SD_TIMEOUT
};

/** 
  * @brief  SD transfer state definition  
  */     
#define   SD_TRANSFER_OK                ((uint8_t)0x00)
#define   SD_TRANSFER_BUSY              ((uint8_t)0x01)
#define   SD_TRANSFER_ERROR             ((uint8_t)0x02)

/**
  * @}
  */
  
/**
  * @brief  SD status structure definition
  */
typedef struct
{
    uint8_t  Reserved1:2;               /* Reserved */
    uint16_t DeviceSize:12;             /* Device Size */
    uint8_t  MaxRdCurrentVDDMin:3;      /* Max. read current @ VDD min */
    uint8_t  MaxRdCurrentVDDMax:3;      /* Max. read current @ VDD max */
    uint8_t  MaxWrCurrentVDDMin:3;      /* Max. write current @ VDD min */
    uint8_t  MaxWrCurrentVDDMax:3;      /* Max. write current @ VDD max */
    uint8_t  DeviceSizeMul:3;           /* Device size multiplier */
} struct_v1;


typedef struct
{
    uint8_t  Reserved1:6;               /* Reserved */
    uint32_t DeviceSize:22;             /* Device Size */
    uint8_t  Reserved2:1;               /* Reserved */
} struct_v2;

/**
  * @brief  Card Specific Data: CSD Register
  */
typedef struct
{
    /* Header part */
    uint8_t  CSDStruct:2;            /* CSD structure */
    uint8_t  Reserved1:6;            /* Reserved */
    uint8_t  TAAC:8;                 /* Data read access-time 1 */
    uint8_t  NSAC:8;                 /* Data read access-time 2 in CLK cycles */
    uint8_t  MaxBusClkFrec:8;        /* Max. bus clock frequency */
    uint16_t CardComdClasses:12;      /* Card command classes */
    uint8_t  RdBlockLen:4;           /* Max. read data block length */
    uint8_t  PartBlockRead:1;        /* Partial blocks for read allowed */
    uint8_t  WrBlockMisalign:1;      /* Write block misalignment */
    uint8_t  RdBlockMisalign:1;      /* Read block misalignment */
    uint8_t  DSRImpl:1;              /* DSR implemented */

    /* v1 or v2 struct */
    union csd_version {
        struct_v1 v1;
        struct_v2 v2;
    } version;

    uint8_t  EraseSingleBlockEnable:1;  /* Erase single block enable */
    uint8_t  EraseSectorSize:7;         /* Erase group size multiplier */
    uint8_t  WrProtectGrSize:7;         /* Write protect group size */
    uint8_t  WrProtectGrEnable:1;       /* Write protect group enable */
    uint8_t  Reserved2:2;               /* Reserved */
    uint8_t  WrSpeedFact:3;             /* Write speed factor */
    uint8_t  MaxWrBlockLen:4;           /* Max. write data block length */
    uint8_t  WriteBlockPartial:1;       /* Partial blocks for write allowed */
    uint8_t  Reserved3:5;               /* Reserved */
    uint8_t  FileFormatGrouop:1;        /* File format group */
    uint8_t  CopyFlag:1;                /* Copy flag (OTP) */
    uint8_t  PermWrProtect:1;           /* Permanent write protection */
    uint8_t  TempWrProtect:1;           /* Temporary write protection */
    uint8_t  FileFormat:2;              /* File Format */
    uint8_t  Reserved4:2;               /* Reserved */
    uint8_t  crc:7;                     /* Reserved */
    uint8_t  Reserved5:1;               /* always 1*/

} SD_CSD;

/**
  * @brief  Card Identification Data: CID Register
  */
typedef struct
{
    __IO uint8_t  ManufacturerID;       /* ManufacturerID */
    __IO uint16_t OEM_AppliID;          /* OEM/Application ID */
    __IO uint32_t ProdName1;            /* Product Name part1 */
    __IO uint8_t  ProdName2;            /* Product Name part2*/
    __IO uint8_t  ProdRev;              /* Product Revision */
    __IO uint32_t ProdSN;               /* Product Serial Number */
    __IO uint8_t  Reserved1;            /* Reserved1 */
    __IO uint16_t ManufactDate;         /* Manufacturing Date */
    __IO uint8_t  CID_CRC;              /* CID CRC */
    __IO uint8_t  Reserved2;            /* always 1 */
} SD_CID;

/**
  * @brief SD Card information
  */
typedef struct
{
    SD_CSD Csd;
    SD_CID Cid;
  uint32_t CardCapacity;              /*!< Card Capacity */
  uint32_t CardBlockSize;             /*!< Card Block Size */
  uint32_t LogBlockNbr;               /*!< Specifies the Card logical Capacity in blocks   */
  uint32_t LogBlockSize;              /*!< Specifies logical block size in bytes           */
} SD_CardInfo;

/** @defgroup STM32G0C1E_EVAL_SPI_SD_Exported_Constants Exported Constants
  * @{
  */

/**
  * @brief  Block Size
  */
#define SD_BLOCK_SIZE    0x200

/**
  * @brief  SD detection on its memory slot
  */
#define SD_PRESENT               ((uint8_t)0x01)
#define SD_NOT_PRESENT           ((uint8_t)0x00)

#define SD_DATATIMEOUT           ((uint32_t)100000000)

/**
  * @brief SD Card information structure
  */
#define BSP_SD_CardInfo SD_CardInfo

/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_SD_Exported_Functions Exported Functions
  * @{
  */
uint8_t BSP_SD_Init(void);
uint8_t BSP_SD_IsDetected(void);
uint8_t BSP_SD_ReadBlocks(uint32_t *pData, uint32_t ReadAddr, uint32_t NumOfBlocks, uint32_t Timeout);
uint8_t BSP_SD_WriteBlocks(uint32_t *pData, uint32_t WriteAddr, uint32_t NumOfBlocks, uint32_t Timeout);
uint8_t BSP_SD_Erase(uint32_t StartAddr, uint32_t EndAddr);
uint8_t BSP_SD_GetCardState(void);
uint8_t BSP_SD_GetCardInfo(SD_CardInfo *pCardInfo);

/* Link functions for SD Card peripheral */
void    SD_IO_Init(void);
void    SD_IO_CSState(uint8_t state);
void    SD_IO_WriteReadData(const uint8_t *DataIn, uint8_t *DataOut, uint16_t DataLength);
uint8_t SD_IO_WriteByte(uint8_t Data);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */  

#ifdef __cplusplus
}
#endif

#endif /* STM32G0C1E_EVAL_SD_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
